{
  "alumni": [
    {
      "name": "Inrwindeep Singh",
      "profession": "Managing Director, Accenture",
      "batch": "1992-1996",
      "image": "https://media.licdn.com/dms/image/v2/D4D03AQHUWSgqi-wvsg/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1727902691310?e=1743638400&v=beta&t=5wtR_9JpAYfc_AcfCmyPf96Syik0N9KJLlo0g49R5zk",
      "quote": "My time at the university was transformative and set the foundation for my career. Even now whenever I look back, I find myself missing the beautiful campus, the very competent faculty and host of friends I made there among seniors, batchmates, and juniors alike. Today, as I represent my country at the World stage, I continue carrying within me the values and life lessons this institute has installed in me, and I represent all of us together.",
      "location": "INDIA",
      "department": "Computer Science",
      "company": "Accenture"
    },
    {
      "name": "Prince Kumar Singh",
      "profession": "Indian Foreign Service",
      "batch": "2016-2020",
      "image": "https://alumni-website-backend2.onrender.com/uploads/default-profile.png",
      "quote": "I'm Prince Kumar Singh, B.Tech Chemical Engineering (Batch 2016-2020). Those four years were the best part of my life. NITJ blessed me with good friends from different parts of the country. I got good exposure and a conducive environment here. I learned so many things from friends and professors, due to which I scored the highest marks in chemical engineering optional in the history of IFS exam as per my knowledge. Apart from Academics, I was also a member of the library committee and PRAYAAS society.",
      "location": "INDIA",
      "department": "Chemical",
      "company": "Government of India"
    },
    {
      "name": "Sadaf Chaudhary",
      "profession": "Indian Foreign Service",
      "batch": "2012-2016",
      "image": "https://twocircles.net/wp-content/uploads/2021/09/IMG_20210925_183247.jpg",
      "quote": "I am deeply inspired by the strides NIT Jalandhar has made in academics, research, and innovation. The legacy of excellence continues to grow, and it is heartening to see the department grooming young engineers who are ready to address real-world challenges.I extend my heartfelt thanks to the institute and the department for their enduring support and for inviting me to contribute to its legacy. The world is full of opportunities waiting for those who dare to explore and innovate.",
      "location": "INDIA",
      "department": "Electronics",
      "company": "Government of India"
    },
    {
      "name": "Ms Jaspreet Kalra",
      "profession": "Senior Vice President at Citi",
      "batch": "2000-2004",
      "image": "https://alumni-website-backend2.onrender.com/uploads/default-profile.png",
      "quote": "My journey at NITJ helped shape not just my technical skills but also my perspective on leadership and innovation. The rigorous academic environment combined with opportunities for extracurricular growth prepared me well for the challenges of the corporate world.",
      "location": "USA",
      "department": "Information Technology",
      "company": "Citi"
    },
    {
      "name": "Dr. Amit Sharma",
      "profession": "Chief Technology Officer",
      "batch": "1998-2002",
      "image": "https://alumni-website-backend2.onrender.com/uploads/default-profile.png",
      "quote": "The foundation I received at NITJ has been instrumental in my career. The emphasis on both theoretical knowledge and practical application gave me the tools to tackle real-world engineering challenges with confidence and creativity.",
      "location": "Germany",
      "department": "Electrical",
      "company": "Siemens"
    }
  ]
}
